<div style="color:blue">   
    <h1> ETL for a Sales Data Warehouse using AWS - RDS </h1>
</div>

### Sanjay Mamidi 5/17/2019
#### (Course work for Data Analysis and Vizualization Certification at UC Davis)

### Summary

This ETL implemented by __Extracting__ sample data from csv files  and __Transformed__ using Pandas. The data is then __Loaded__  
into a MySQL database using the RDS platform of AWS.The database design implemented is a __Star__ schema.

### Data Source
[Kaggle Sample Data](https://www.kaggle.com/kyanyoga/sample-sales-data)

### ER Diagram
[ER Pic](https://www.draw.io/#G1WB0caaytEtTWGYAoHCIcloBJS3SFlCvr)
[Shareable link] (https://drive.google.com/file/d/1WB0caaytEtTWGYAoHCIcloBJS3SFlCvr/view?usp=sharing)

### Repository
Implemented using AWS MySQL RDS Data Repository.
[AWS RDS Platform] etldb.cnbpyehug8lo.us-east-2.rds.amazonaws.com

### Methodology
Data is extracted and loaded into five dimension tables(Geography,Time,Deal Size,ProductLine,Customer) and 
one Fact table holding numerical measures like Sales and Quantity. For purposes of meeting coursework requirements 
the dimension tables have not been futher decomposed into geography or customer Heirarchies. Also not all of the data
columns have been used to develop this sample application. 
         "todo" add info around data loading and keys

In [2]:
# imports
import pymysql as psql
from sqlalchemy import create_engine
from sqlalchemy.sql import text
import pandas as pd
from sqlalchemy.sql import text
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy import Column, Integer, String, Numeric
from sqlalchemy.orm import sessionmaker
import turbodbc
from datetime import datetime
import numpy as np
from sqlalchemy import text

   ### AWS Connection Details. Instantiate the connection parameters to the ETLDEV database here. 
    (Previously created and configured the database on the AWS RDS website)

In [3]:
engine = create_engine("mysql+mysqldb://a****:m********@etldb.cnbpyehug8lo.us-east-2.rds.amazonaws.com:3306/etldev")

### Data Set Loaded

In [4]:
sales_df = pd.read_csv('1/sample-sales-data/sales_data_sample.csv',encoding='latin1')
sales_df.tail()

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
2818,10350,20,100.00,15,2244.40,12/2/2004 0:00,Shipped,4,12,2004,...,"C/ Moralzarzal, 86",NaN,Madrid,NaN,28034,Spain,EMEA,Freyre,Diego,Small
2819,10373,29,100.00,1,3978.51,1/31/2005 0:00,Shipped,1,1,2005,...,Torikatu 38,NaN,Oulu,NaN,90110,Finland,EMEA,Koskitalo,Pirkko,Medium
2820,10386,43,100.00,4,5417.57,3/1/2005 0:00,Resolved,1,3,2005,...,"C/ Moralzarzal, 86",NaN,Madrid,NaN,28034,Spain,EMEA,Freyre,Diego,Medium
2821,10397,34,62.24,1,2116.16,3/28/2005 0:00,Shipped,1,3,2005,...,1 rue Alsace-Lorraine,NaN,Toulouse,NaN,31000,France,EMEA,Roulet,Annette,Small
2822,10414,47,65.52,9,3079.44,5/6/2005 0:00,On Hold,2,5,2005,...,8616 Spinnaker Dr.,NaN,Boston,MA,51003,USA,NaN,Yoshido,Juri,Medium

In [23]:
sales_df.count()

QUANTITYORDERED    2924
PRICEEACH          2924
SALES              2924
ORDERDATE          2924
STATUS             2924
QTR_ID_x           2924
MONTH_ID_x         2924
YEAR_ID_x          2924
PRODUCTLINE        2924
MSRP               2924
CUSTOMERNAME       2924
CITY               2924
STATE_x            1359
COUNTRY_x          2924
TERRITORY_x        1828
DEALSIZE           2924
CUSTOMERN_PK       2924
DEALSIZE_PK        2924
DealSize           2924
ProductLine_PK     2924
ProductLine        2924
ORDERDATE_PK       2924
QTR_ID_y           2924
MONTH_ID_y         2924
YEAR_ID_y          2924
CITY_PK            2924
STATE_y            1359
COUNTRY_y          2924
TERRITORY_y        1828
dtype: int64

### Initial List of Columns

In [5]:
sales_df.columns

Index(['ORDERNUMBER', 'QUANTITYORDERED', 'PRICEEACH', 'ORDERLINENUMBER',
       'SALES', 'ORDERDATE', 'STATUS', 'QTR_ID', 'MONTH_ID', 'YEAR_ID',
       'PRODUCTLINE', 'MSRP', 'PRODUCTCODE', 'CUSTOMERNAME', 'PHONE',
       'ADDRESSLINE1', 'ADDRESSLINE2', 'CITY', 'STATE', 'POSTALCODE',
       'COUNTRY', 'TERRITORY', 'CONTACTLASTNAME', 'CONTACTFIRSTNAME',
       'DEALSIZE'],
      dtype='object')

### Dropping those columns that we dont need in this project

In [6]:
sales_df.drop(columns= ['ORDERNUMBER','ORDERLINENUMBER','ADDRESSLINE1','ADDRESSLINE2',\
       'PHONE', 'POSTALCODE','CONTACTLASTNAME', 'CONTACTFIRSTNAME','PRODUCTCODE'], axis = 1, inplace = True)

### Fact Table Columns!! What are we going to measure?  
### At this step we only identify the table columns but not populate the Fact Table yet

In [7]:
TableF_df = sales_df[['QUANTITYORDERED', 'PRICEEACH', 'SALES']]
TableF_df.head()

   QUANTITYORDERED  PRICEEACH    SALES
0               30      95.70  2871.00
1               34      81.35  2765.90
2               41      94.74  3884.34
3               45      83.26  3746.70
4               49     100.00  5205.27

###  The Dimension Tables - We start with the Time Dimension

In [8]:
# Setting the OrderDate columns to datetime datatime compatible between Pandas and Mysql database.
sales_df['ORDERDATE'] = pd.to_datetime(sales_df['ORDERDATE'])
TimeD_df = sales_df[['QTR_ID', 'MONTH_ID', 'YEAR_ID','ORDERDATE']].copy()
TimeD_df.head()

   QTR_ID  MONTH_ID  YEAR_ID  ORDERDATE
0       1         2     2003 2003-02-24
1       2         5     2003 2003-05-07
2       3         7     2003 2003-07-01
3       3         8     2003 2003-08-25
4       4        10     2003 2003-10-10

### We are only interested in the unique combination of values to create our Primary Key.

In [9]:
TimeD_df = TimeD_df.drop_duplicates()

### We then load this data and we rely on Auto Increment table function to create the Index(Primary Key) at time of dataload in the database.

In [10]:
TimeD_df.to_sql('Time',con=engine,if_exists ='append',index=False)

### We then pull this db loaded dataset back into the local time dimension dataframe for 2 reasons
 * We need the index to load into the Fact table 
 * We need the primary key raw data for the Fact table merge(ie join)

In [11]:
TimeD_df = pd.read_sql("Select * from Time",con=engine)
TimeD_df.tail()

     ORDERDATE_PK  QTR_ID  MONTH_ID YEAR_ID  ORDERDATE
247           248       2         4    2003 2003-04-11
248           249       3         8    2003 2003-08-13
249           250       4        10    2003 2003-10-08
250           251       1         3    2005 2005-03-28
251           252       2         4    2003 2003-04-21

### Geography Dimension

In [12]:
GeographyD_df = sales_df[['CITY', 'STATE', 'COUNTRY', 'TERRITORY']].copy()
GeographyD_df = GeographyD_df.drop_duplicates()
GeographyD_df.to_sql('Geography',con=engine,if_exists ='append',index=False)
GeographyD_df = pd.read_sql('SELECT * FROM Geography', con=engine)
GeographyD_df.head()

   CITY_PK           CITY STATE COUNTRY TERRITORY
0        1            NYC    NY     USA      None
1        2          Reims  None  France      EMEA
2        3          Paris  None  France      EMEA
3        4       Pasadena    CA     USA      None
4        5  San Francisco    CA     USA      None

### Product Dimension

In [13]:
ProductD_df = sales_df[['PRODUCTLINE']].copy()
ProductD_df = ProductD_df.drop_duplicates()
ProductD_df.to_sql('Product',con=engine,if_exists ='append',index=False)
ProductD_df = pd.read_sql('SELECT * FROM Product', con=engine)
ProductD_df.head()

   ProductLine_PK       ProductLine
0               1       Motorcycles
1               2      Classic Cars
2               3  Trucks and Buses
3               4      Vintage Cars
4               5            Planes

### Deal Size Dimension

In [14]:
DealSizeD_df = sales_df[['DEALSIZE']].copy()
DealSizeD_df = DealSizeD_df.drop_duplicates()
DealSizeD_df.to_sql('DealSize',con=engine,if_exists ='append',index=False)
DealSizeD_df = pd.read_sql('SELECT * FROM DealSize', con=engine)
DealSizeD_df.head()

   DEALSIZE_PK DealSize
0            1    Small
1            2   Medium
2            3    Large

### Customer Dimension

In [15]:
CustomerD_df = sales_df[['CUSTOMERNAME']].copy()
CustomerD_df = CustomerD_df['CUSTOMERNAME'].drop_duplicates()
CustomerD_df.to_sql("Customer",con=engine,if_exists ='append',index=False)
CustomerD_df = pd.read_sql('SELECT * FROM Customer', con=engine)
CustomerD_df.tail()

    CUSTOMERN_PK                        CUSTOMERNAME
87            88        Australian Collectables, Ltd
88            89                    Gift Ideas Corp.
89            90  Bavarian Collectables Imports, Co.
90            91                        Royale Belge
91            92             Auto-Moto Classics Inc.

In [16]:
display(DealSizeD_df.head())

display(CustomerD_df.head())

display(ProductD_df.head())

display(DealSizeD_df.head())

display(GeographyD_df.head())

display(TimeD_df.head())

   DEALSIZE_PK DealSize
0            1    Small
1            2   Medium
2            3    Large

   CUSTOMERN_PK              CUSTOMERNAME
0             1         Land of Toys Inc.
1             2        Reims Collectables
2             3           Lyon Souveniers
3             4         Toys4GrownUps.com
4             5  Corporate Gift Ideas Co.

   ProductLine_PK       ProductLine
0               1       Motorcycles
1               2      Classic Cars
2               3  Trucks and Buses
3               4      Vintage Cars
4               5            Planes

   DEALSIZE_PK DealSize
0            1    Small
1            2   Medium
2            3    Large

   CITY_PK           CITY STATE COUNTRY TERRITORY
0        1            NYC    NY     USA      None
1        2          Reims  None  France      EMEA
2        3          Paris  None  France      EMEA
3        4       Pasadena    CA     USA      None
4        5  San Francisco    CA     USA      None

   ORDERDATE_PK  QTR_ID  MONTH_ID YEAR_ID  ORDERDATE
0             1       1         2    2003 2003-02-24
1             2       2         5    2003 2003-05-07
2             3       3         7    2003 2003-07-01
3             4       3         8    2003 2003-08-25
4             5       4        10    2003 2003-10-10

### Each Dimension is now joined back to the main sales_df based on the dimension table key column

In [17]:
sales_df = sales_df.merge(CustomerD_df, on='CUSTOMERNAME', how='inner')
sales_df = sales_df.merge(DealSizeD_df,left_on = 'DEALSIZE', right_on = 'DealSize', how = 'inner')
sales_df = sales_df.merge(ProductD_df,left_on = 'PRODUCTLINE', right_on = 'ProductLine', how = 'inner')
sales_df = sales_df.merge(TimeD_df,left_on = 'ORDERDATE', right_on = 'ORDERDATE', how = 'inner')
sales_df = sales_df.merge(GeographyD_df,left_on = 'CITY', right_on = 'CITY', how = 'inner')
sales_df.head()

,QUANTITYORDERED,PRICEEACH,SALES,ORDERDATE,STATUS,QTR_ID_x,MONTH_ID_x,YEAR_ID_x,PRODUCTLINE,MSRP,...,ProductLine_PK,ProductLine,ORDERDATE_PK,QTR_ID_y,MONTH_ID_y,YEAR_ID_y,CITY_PK,STATE_y,COUNTRY_y,TERRITORY_y
0,30,95.70,2871.00,2003-02-24,Shipped,1,2,2003,Motorcycles,95,...,1,Motorcycles,1,1,2,2003,1,NY,USA,None
1,29,70.87,2055.23,2003-02-24,Shipped,1,2,2003,Motorcycles,60,...,1,Motorcycles,1,1,2,2003,1,NY,USA,None
2,25,100.00,2845.75,2003-02-24,Shipped,1,2,2003,Motorcycles,112,...,1,Motorcycles,1,1,2,2003,1,NY,USA,None
3,20,92.90,1858.00,2003-02-24,Shipped,1,2,2003,Motorcycles,99,...,1,Motorcycles,1,1,2,2003,1,NY,USA,None
4,39,99.91,3896.49,2003-02-24,Shipped,1,2,2003,Motorcycles,118,...,1,Motorcycles,1,1,2,2003,1,NY,USA,None

### Now get the subset of columns and populate the fact table

In [18]:
Fact_df = sales_df[['QUANTITYORDERED', 'PRICEEACH','ProductLine_PK', 'SALES', 'ORDERDATE_PK','CITY_PK', 'DEALSIZE_PK','CUSTOMERN_PK']].copy()                      
Fact_df.to_sql("FACT",con=engine,if_exists ='append',index=False)
Fact_df= pd.read_sql('SELECT * FROM FACT', con=engine)
Fact_df.tail()
fact_df.count()

,DEALSIZE_PK,CITY_PK,CUSTOMERN_PK,ProductLine_PK,ORDERDATE_PK,QUANTITYORDERED,PRICEEACH,SALES
2919,1,74,90,5,193,22.0,81.0,1778.0
2920,1,74,90,5,193,21.0,45.0,949.0
2921,2,74,90,5,193,36.0,100.0,5677.0
2922,2,74,90,5,193,42.0,100.0,4297.0
2923,2,74,90,5,193,47.0,87.0,4071.0

In [21]:
Fact_df.count()

DEALSIZE_PK        2924
CITY_PK            2924
CUSTOMERN_PK       2924
ProductLine_PK     2924
ORDERDATE_PK       2924
QUANTITYORDERED    2924
PRICEEACH          2924
SALES              2924
dtype: int64

# Sample Query

In [19]:
sql = text(  'select ProductLine, sum(Sales) as "Sales in Money" , sum(QuantityOrdered) as TotalQty,' \
            ' c.DealSize, f.CustomerName, City, Orderdate from FACT a, Product b , DealSize c, Geography d,' \
            ' Time e , Customer f where a.ProductLine_PK = b.ProductLine_PK '\
            ' and a.DEALSIZE_PK = c.DEALSIZE_PK '\
            ' and a.ORDERDATE_PK = e.ORDERDATE_PK '\
            ' and a.CITY_PK = d.CITY_PK '\
            ' and a.Customern_PK = f.customern_pk'
            ' and d.State = "CA" '\
            ' group by DealSize, City, ProductLine '\
            ' order by City, Orderdate desc' )
        
query_df = pd.read_sql_query(sql, con=engine, params={})

query_df

,ProductLine,Sales in Money,TotalQty,DealSize,CustomerName,City,Orderdate
0,Trucks and Buses,4892.0,48.0,Medium,Signal Collectibles Ltd.,Brisbane,2004-02-10
1,Classic Cars,8449.0,43.0,Large,Signal Collectibles Ltd.,Brisbane,2004-02-10
2,Trucks and Buses,1932.0,35.0,Small,Signal Collectibles Ltd.,Brisbane,2004-02-10
3,Classic Cars,847.0,21.0,Small,Signal Collectibles Ltd.,Brisbane,2004-02-10
4,Vintage Cars,9678.0,185.0,Small,Signal Collectibles Ltd.,Brisbane,2003-09-12
5,Vintage Cars,24423.0,182.0,Medium,Signal Collectibles Ltd.,Brisbane,2003-09-12
6,Vintage Cars,18883.0,178.0,Medium,West Coast Collectables Co.,Burbank,2004-01-29
7,Classic Cars,6075.0,35.0,Medium,West Coast Collectables Co.,Burbank,2004-01-29
8,Trucks and Buses,5152.0,46.0,Medium,West Coast Collectables Co.,Burbank,2004-01-29
9,Vintage Cars,8853.0,166.0,Small,West Coast Collectables Co.,Burbank,2003-12-01
10,Planes,7121.0,86.0,Medium,West Coast Collectables Co.,Burbank,2003-12-01
11,Motorcycles,32703.0,255.0,Medium,Technics Stores Inc.,Burlingame,2003-10-28
12,Planes,25990.0,251.0,Medium,Technics Stores Inc.,Burlingame,2003-10-28
13,Vintage Cars,6030.0,108.0,Small,Technics Stores Inc.,Burlingame,2003-10-28
14,Motorcycles,6143.0,98.0,Small,Technics Stores Inc.,Burlingame,2003-10-28
15,Planes,9140.0,111.0,Small,Technics Stores Inc.,Burlingame,2003-10-28
16,Classic Cars,7374.0,37.0,Large,Technics Stores Inc.,Burlingame,2003-07-24
17,Trucks and Buses,7383.0,100.0,Small,Technics Stores Inc.,Burlingame,2003-07-24
18,Classic Cars,7303.0,62.0,Medium,Technics Stores Inc.,Burlingame,2003-07-24
19,Trucks and Buses,18717.0,157.0,Medium,Technics Stores Inc.,Burlingame,2003-07-24
20,Planes,10229.0,131.0,Small,Gift Ideas Corp.,Glendale,2004-12-04
21,Vintage Cars,6322.0,100.0,Small,Gift Ideas Corp.,Glendale,2004-12-04
22,Planes,27056.0,282.0,Medium,Gift Ideas Corp.,Glendale,2004-12-04
23,Vintage Cars,3288.0,40.0,Medium,Gift Ideas Corp.,Glendale,2004-12-04
24,Ships,4208.0,58.0,Small,Boards & Toys Co.,Glendale,2003-10-02
25,Motorcycles,6890.0,93.0,Medium,Gift Ideas Corp.,Glendale,2003-09-03
26,Classic Cars,8432.0,64.0,Medium,Gift Ideas Corp.,Glendale,2003-09-03
27,Ships,5745.0,61.0,Small,"Men 'R' US Retailers, Ltd.",Los Angeles,2004-01-09
28,Planes,3535.0,43.0,Medium,"Men 'R' US Retailers, Ltd.",Los Angeles,2004-01-09
29,Vintage Cars,7266.0,78.0,Small,"Men 'R' US Retailers, Ltd.",Los Angeles,2004-01-09
...,...,...,...,...,...,...,...
61,Motorcycles,17455.0,256.0,Small,Corporate Gift Ideas Co.,San Francisco,2003-10-10
62,Classic Cars,25829.0,204.0,Medium,Corporate Gift Ideas Co.,San Francisco,2003-10-10
63,Motorcycles,37356.0,278.0,Medium,Corporate Gift Ideas Co.,San Francisco,2003-10-10
64,Vintage Cars,21390.0,134.0,Large,The Sharp Gifts Warehouse,San Jose,2005-04-22
65,Classic Cars,20356.0,209.0,Medium,The Sharp Gifts Warehouse,San Jose,2005-04-22
66,Classic Cars,23891.0,199.0,Large,The Sharp Gifts Warehouse,San Jose,2005-04-22
67,Classic Cars,5620.0,103.0,Small,The Sharp Gifts Warehouse,San Jose,2005-04-22
68,Ships,2245.0,30.0,Small,The Sharp Gifts Warehouse,San Jose,2005-04-01
69,Ships,4039.0,46.0,Medium,The Sharp Gifts Warehouse,San Jose,2005-04-01
70,Motorcycles,2803.0,32.0,Small,The Sharp Gifts Warehouse,San Jose,2004-05-11
71,Planes,19401.0,153.0,Medium,The Sharp Gifts Warehouse,San Jose,2004-05-11
72,Vintage Cars,20350.0,267.0,Medium,The Sharp Gifts Warehouse,San Jose,2004-05-11
73,Motorcycles,3282.0,31.0,Medium,The Sharp Gifts Warehouse,San Jose,2004-05-11
74,Planes,8160.0,45.0,Large,The Sharp Gifts Warehouse,San Jose,2004-05-11
75,Planes,18932.0,252.0,Small,The Sharp Gifts Warehouse,San Jose,2004-05-11
76,Vintage Cars,9538.0,155.0,Small,The Sharp Gifts Warehouse,San Jose,2004-05-11
77,Vintage Cars,41178.0,740.0,Small,Mini Gifts Distributors Ltd.,San Rafael,2005-03-04
78,Vintage Cars,95393.0,832.0,Medium,Mini Gifts Distributors Ltd.,San Rafael,2005-03-04
79,Trains,14002.0,191.0,Small,Mini Gifts Distributors Ltd.,San Rafael,2005-01-23
80,Trucks and Buses,93310.0,767.0,Medium,Mini Gifts Distributors Ltd.,San Rafael,2004-12-10
81,Trucks and Buses,31123.0,465.0,Small,Mini Gifts Distributors Ltd.,San Rafael,2004-12-10
82,Trains,7307.0,78.0,Medium,Mini Gifts Distributors Ltd.,San Rafael,2004-08-20
83,Ships,19669.0,206.0,Medium,Mini Gifts Distributors Ltd.,San Rafael,2004-08-20
84,Vintage Cars,32396.0,181.0,Large,Mini Gifts Distributors Ltd.,San Rafael,2003-11-12
85,Ships,11218.0,165.0,Small,Mini Gifts Distributors Ltd.,San Rafael,2003-08-08
86,Classic Cars,60764.0,310.0,Large,Mini Gifts Distributors Ltd.,San Rafael,2003-07-02
87,Classic Cars,41230.0,624.0,Small,Mini Gifts Distributors Ltd.,San Rafael,2003-07-02
88,Motorcycles,14387.0,258.0,Small,Mini Gifts Distributors Ltd.,San Rafael,2003-07-02
89,Classic Cars,180093.0,1447.0,Medium,Mini Gifts Distributors Ltd.,San Rafael,2003-07-02
90,Motorcycles,12795.0,102.0,Medium,Mini Gifts Distributors Ltd.,San Rafael,2003-07-02